title: LSASS Memory Dump Attempt
id: 500003
status: stable
description: Detects potential credential dumping from LSASS
logsource:
  product: windows

detection:
  selection:
    CommandLine|contains:
      - "lsass"
      - "procdump"
  condition: selection
level: critical
tags:
  - attack.credential_access
  - attack.t1003